kthunder/STM32F40X/src/Drivers/HAL_Driver/Src/hal_spi.c
#include "stm32f4xx.h"
#include "hal_spi.h"
#include "hal_def.h"
#include "hal_gpio.h"

/***
 * SPI初始化
 * 1. 设置波特率
 * 2. 设置极性相位
 * 3. 设置DFF位，定义数据帧格式
 * 4. 配置LSB或者MSB
 * 5. 设置FRF位
 */
uint32_t SPI_Init(SPI_TypeDef *SPIx)
{
    // SET_BIT(SPIx->CR1, SPI_CR1_CPHA);
    // SET_BIT(SPIx->CR1, SPI_CR1_CPOL);
    SET_BIT(SPIx->CR1, SPI_CR1_MSTR);
    SET_BIT(SPIx->CR1, SPI_CR1_LSBFIRST);
    // SET_BIT(SPIx->CR1, SPI_CR1_SSM);
    CLEAR_BIT(SPIx->CR1, SPI_CR1_BIDIMODE);
    WRITE_BIT(SPIx->CR1, SPI_CR1_BR, 5);

    CLEAR_BIT(SPIx->CR2, SPI_CR2_FRF);
    SET_BIT(SPIx->CR2, SPI_CR2_SSOE);
    SET_BIT(SPIx->CR1, SPI_CR1_SPE);

    GPIO_SetBits(GPIOA, GPIO_Pin_4);
    return HAL_OK;
}

uint32_t SPI_Transmit(SPI_TypeDef *SPIx, uint8_t *pTxBuffer, uint8_t *pRxBuffer, uint32_t len)
{
    SET_BIT(SPIx->CR1, SPI_CR1_SPE);
    // CLEAR_BIT(SPIx->CR1, SPI_CR1_SSI);
    GPIO_ResetBits(GPIOA, GPIO_Pin_4);
    while (len)
    {
        WAITE_LOW(SPIx->SR, SPI_SR_BSY);

        WAITE_HIGH(SPIx->SR, SPI_SR_TXE);
        WRITE_REG(SPIx->DR, *(pTxBuffer++));

        WAITE_HIGH(SPIx->SR, SPI_SR_RXNE);
        *(pRxBuffer++) = (uint8_t)READ_REG(SPIx->DR);

        WAITE_LOW(SPIx->SR, SPI_SR_BSY);

        len--;
    }
    // SET_BIT(SPIx->CR1, SPI_CR1_SSI);
    GPIO_SetBits(GPIOA, GPIO_Pin_4);
    CLEAR_BIT(SPIx->CR1, SPI_CR1_SPE);
    return HAL_OK;
}